In [4]:
import psycopg2
import sqlalchemy
import pandas as pd

In [2]:
conn = "postgresql://retail_user:1234@localhost:5432/retail_db"

In [3]:
query = "select * from orders where order_status = 'COMPLETE'"

In [6]:
pd.read_sql(
    query,conn
)

       order_id order_date  order_customer_id order_status
0             3 2013-07-25              12111     COMPLETE
1             5 2013-07-25              11318     COMPLETE
2             6 2013-07-25               7130     COMPLETE
3             7 2013-07-25               4530     COMPLETE
4            15 2013-07-25               2568     COMPLETE
...         ...        ...                ...          ...
22894     68876 2014-07-06               4124     COMPLETE
22895     68878 2014-07-08               6753     COMPLETE
22896     68879 2014-07-09                778     COMPLETE
22897     68880 2014-07-13               1117     COMPLETE
22898     68883 2014-07-23               5533     COMPLETE

[22899 rows x 4 columns]